p1/app/views/photos/index.html.erb

							<% comments.each do |comment| %>
								<% name = comment.user.first_name + " " + comment.user.last_name + ": " %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]