p1/app/views/photos/view_tags.html.erb

		<% @tags.each do |tag| %>
			<% tagged_user = User.find(tag.tagged_user_id) %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = 4 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]