p1/app/controllers/comments_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def new
        @photo = Photo.find(params[:id])
        if session[:user_id]
            @user = User.find(session[:user_id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("comment", "date_time", "photo_id", "user_id") VALUES (?, ?, ?, ?)  [["comment", "blah"], ["date_time", Fri, 17 May 2013 20:49:23 UTC +00:00], ["photo_id", 7], ["user_id", 3]]
---
    def create
        photo = Photo.find(params[:photo_id])
        if session[:user_id]
            user = User.find(session[:user_id])
            comment = Comment.new
            comment.user_id = user.id
            comment.photo_id = photo.id
            comment.date_time = DateTime.now
            comment.comment = params[:comment_val]
            comment.save()