p1/app/controllers/photos_controller.rb

	def index
		if(params[:id] != nil) then
			@user = User.find(params[:id])
			@photos = Photo.find(:all, :conditions => "user_id = " + @user.id.to_s);
			@title = @user.first_name + " " + @user.last_name + ": Photos"
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = 2 LIMIT 1
SELECT "photos".* FROM "photos"

	def new
		if session[:user_id] then
			@user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]

	def create
		if session[:user_id] then
			file = params[:photo][:file_val];
			name = file.original_filename
			directory = "public/images"
			path = File.join(directory, name)
			File.open(path, "wb") { |f| f.write(file.read) }
			user = User.find(session[:user_id])
			photo = Photo.new
			photo.user_id = user.id
			photo.date_time = DateTime.now
			photo.file_name = name
			photo.save()
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("date_time", "file_name", "user_id") VALUES (?, ?, ?)  [["date_time", Sat, 18 May 2013 06:09:46 UTC +00:00], ["file_name", "IMG_0688.JPG"], ["user_id", 1]]

    def new_tag
        if session[:user_id] then
            @photo = Photo.find(params[:id])
            @user = User.find(session[:user_id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]

    def create_tag
        if session[:user_id] then
            if params[:hidden_x] != -1 then
                tag = Tag.new
                tag.photo_id = params[:id]
                tag.tagged_user_id = params[:tagged_user]
                tag.xCoord = params[:hidden_x]
                tag.yCoord = params[:hidden_y]
                tag.width = params[:hidden_width]
                tag.height = params[:hidden_height]
                tag.save()

                photo = Photo.find(params[:id])
---
INSERT INTO "tags" ("height", "photo_id", "tagged_user_id", "width", "xCoord", "yCoord") VALUES (?, ?, ?, ?, ?, ?)  [["height", nil], ["photo_id", 4], ["tagged_user_id", nil], ["width", nil], ["xCoord", nil], ["yCoord", nil]]
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "4"]]

    def view_tags
        @title = "Photo Tags"
        @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "4"]]