p1/app/controllers/users_controller.rb

	def post_login
		user = User.find_by_login(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."login" = 'bieber' LIMIT 1

    def create
        user = User.new
        user.first_name = params[:first_name]
        user.last_name = params[:last_name]
        user.login = params[:username]
        salt = Random.rand(1000)
        password = params[:password]
        salted_password = password + salt.to_s
        pw_digest = Digest::SHA1.hexdigest(salted_password)
        user.password_digest = pw_digest
        user.salt = salt
        user.save()
---
INSERT INTO "users" ("first_name", "last_name", "login", "password_digest", "salt") VALUES (?, ?, ?, ?, ?)  [["first_name", "test"], ["last_name", "user"], ["login", "test"], ["password_digest", "285db72037b7a13e7c7802a3abbdd6e95943cd7b"], ["salt", 281]]

    def photo_search
    	if(params[:id] != nil)
    	search_val = params[:id]
    	photos = Array.new
    	comments = Comment.find(:all, :conditions => ["comment LIKE ?", '%' + search_val + '%'])
    	puts(comments)
    	if(!comments.empty?)
    		comments.each do |comment|
    			photos.push(comment.photo)
    		end
    	end
    	users = User.find(:all, :conditions => ["first_name LIKE ? or last_name LIKE ?", '%' + search_val + '%', '%' + search_val + '%'])
    	if(!users.empty?)
    		users.each do |user|
    			tags = Tag.find_all_by_tagged_user_id(user.id)
    			if(!tags.empty?)
    				tags.each do |tag|
    					photos.push(Photo.find(tag.photo_id))
---
SELECT "comments".* FROM "comments" WHERE (comment LIKE '%wef%')
SELECT "users".* FROM "users" WHERE (first_name LIKE '%rf%' or last_name LIKE '%rf%')
SELECT "tags".* FROM "tags" WHERE "tags"."tagged_user_id" = 1 LIMIT 1
SELECT "photos".* FROM "photos" WHERE "photos"."id" = 1 LIMIT 1